# RebarArrayTooShort Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarFailures..::..RebarArrayTooShort Property
BuiltInFailures..::..RebarFailures Class See Also
---
Rebar Set can't have coincident Bars.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RebarArrayTooShort { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarArrayTooShort As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RebarArrayTooShort {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarFailures Class
Autodesk.Revit.DB Namespace